Repository: luan-u/tvt-br-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: pt_br

source: So games had to be difficult so players would feel they got their money's worth.
pt_br: Por isso os jogos precisavam ser difíceis para que os jogadores sentissem que o jogo vale cada centavo gasto.

source: So he's already technically "invisible" even if he doesn't become transparent.
pt_br: Então de certo modo ele já fica "invisível" mesmo que ele não fique transparente de fato.

source: So instead, the villain is the one who wants to change the world, and the hero stops him to make sure nothing has to change.
pt_br: Por isso é o vilão que deseja mudar o mundo e o herói o impede para certificar que nada precise mudar.

source: So it's Administrivia/NotATrope, but because it's too rare to have [[Administrivia/ThreeRulesOfThree enough examples]] (at least at the moment).
pt_br: Então BrAdministrivia/NaoEUmTropo, mas apenas porque é raro demais para ter [[BrAdministrivia/TresRegrasDeTres exemplos suficientes]] (pelo menos no momento).

source: So what makes a character a Magnificent Bastard?
pt_br: Então, o que faz com que um personagem seja um Canalha Magnífico?

source: So while some people still complain that a show like ''Series/AmericasFunniestHomeVideos'' where people repeatedly fall and get hit in the crotch is not amusing, it's not really surprising that the show still continues to be popular across all demographics for well over 20 years even in the face of the infinite spring of funny home videos that are modern social networks.
pt_br: Por isso, ainda que algumas pessoas reclamem que shows que consistem em compilados de pessoas caindo ou se machucando na virilha não são engraçados, não é realmente surpreendente que esses programas continuem sendo populares através de uma ampla faixa demográfica por mais de 20 anos, mesmo com as fontes praticamente intermináveis de vídeos caseiros engraçados que são fornecidas pelas redes sociais.

source: So, Don Ramón suggests he takes the vecindad from Señor Barriga and since in 20 years his debt will reach the vecindad's value, they will be even.
pt_br: Então o Seu Madruga sugere que ele fique com a vila do Senhor Barriga, já que em 20 anos o débito vai alcançar o valor da vila e então eles ficarão quites.

source: Some characters do not have complete free will, be they robots that are ThreeLawsCompliant because of a MoralityChip, or victims of a {{Geas}} spell that compels them to obey a wizard's decree, or a more mundane [[CharacterAlignment lawful character]] who must [[TheFettered struggle to uphold their oath]] ''and'' obey their lord.
pt_br: Alguns personagens não possuem livre arbítrio completo, sejam eles robôs que possuem Br/ConformidadeComAsTresLeis por causa de um Br/ChipDeMoralidade ou vítimas de uma magia Br/{{Geas}} que os força a obedecer o decreto de um mago, ou um [[Br/AlinhamentoDePersonagem personagem leal]] mais mundano que deve [[Br/OAcorrentado ter dificuldade em seguir seu juramento]] ''e'' seguir o seu senhor.

source: Some editors spend [[JustOneMoreLevel 7 hour+ periods]] just [[ArchiveBinge reading through the thousands of pages]], going through an extended WikiWalk.
pt_br: Alguns editores passam ''[[Br/SoMaisUmaFase muitas horas]]'' simplesmente [[Br/MaratonaDeArquivo lendo as várias páginas]], desfrutando de um Br/WikiPasseio estendido.

source: Some examples include Binho being racist towards Zuca or refusing to eat any of the food his mother made (and having the scruples to say '''his''' mother makes '''him''' upset), Zuca kicking or otherwise harrassing several animals, and Tato beating up Rebeca for winning against him.
pt_br: Alguns exemplos incluem Binho sendo racista com Zuca ou se recusando a comer a comida que a mãe dele preparou (e ainda tendo a audácia de dizer que a ''mãe'' deixa ''ele'' com raiva), Zuca chutando ou maltratando diversos animais, e Tato batendo em Rebeca por ter perdido pra ela.

source: Some fans treat such sequels with FanonDiscontinuity.
pt_br: Alguns fãs tratam tais sequências com a Br/DescontinuidadeDeFanone.

source: Some gamers deride Character Alignments as crutches to "real roleplaying", so some systems accordingly have none at all.
pt_br: Alguns jogadores menosprezam o alinhamento de personagem por o considerarem como muletas para "interpretação real", e em acordo alguns sistemas não possuem alinhamentos de personagem.

source: Some names like this are [[AwesomeMcCoolname downright cool]].
pt_br: Alguns desses nomes são [[Br/NomeIncrivelmenteIradoDaSilva simplesmente demais]].

source: Some of it comes from ''how'' people use TV, too.
pt_br: Parte dele tem a ver sobre ''como'' as pessoas usam a televisão.

source: Some of the characters basically become permanent substitutes, like Ñoño and Popis (With both taking Quico's LiteralMinded and TooDumbToLive traits, respectively).
pt_br: Alguns dos personagens se tornaram substitutos permanentes, como Nhonho e Popis (que herdaram do Quico os aspectos de Br/MenteLiteral e Br/BurroDemaisParaViver, respectivamente).

source: Some of the lines were so well integrated into the collective consciousness of gamers that they have been ''embraced'' by the fandom instead of reviled once the original script was retranslated.
pt_br: Algumas das linhas foram tão bem integradas pelo imaginário coletivo dos gamers que elas foram ''adotadas'' pelo fandom ao invés de rejeitadas depois que o texto original foi retraduzido.

source: Some plots lend themselves to the nature of a Bottle Episode, such as SinkingShipScenario, GroundhogDayLoop, LockedInARoom, or EpisodeOnAPlane.
pt_br: Algumas tramas são naturalmente propícias para um episódio engarrafado, como aquelas que envolvem um Br/CenarioDeNavioNaufragando, Br/CicloDoDiaDaMarmota, Br/TrancadosEmUmComodo ou Br/EpisodioEmUmAviao.

source: Some retcons occur for no purpose other than to address a [[PlotHole "goof" in the scriptwriting]] that aired before it was spotted.
pt_br: Alguns ''retcons'' acontecem com o propósito de corrigir um [[Br/FuroNaTrama vacilo no roteiro]] que foi ao ar antes de se identificado.

source: Some specific cases of Bittersweet Endings are: * DidNotGetTheGirl: When the OfficialCouple is [[BreakHisHeartToSaveHim broken for the right cause]].
pt_br: Alguns casos específicos de finais agridoces são: * Br/NaoConseguiuAGarota: Quando o Br/CasalOficial é [[Br/PartaOCoracaoDeleParaOSalvar separado pelo bem maior]].

source: Some video games offer dialogue trees or something similar that might allow your character to call someone out for their horrible behavior, which can be immensely satisfying.
pt_br: Alguns videogames oferecem opções de diálogo (ou algo similar) que permitem que o seu personagem aponte as ações terríveis de alguém, o que pode ser muito satisfatório.

source: Some who jump at the call are not really cut out for heroism, and sometimes they pull it off anyway.
pt_br: Alguns que se jogam no chamado não são realmente adequados para o heroísmo, mas às vezes conseguem fazer dar certo mesmo assim.

source: Some writers try to defend the Faust by turning the deal into a LeonineContract - either the deal was made when the Faust was in desperate straits or under some kind of duress, or the Mephistopheles made the offer when the victim had no time to think (e.g., offering to save him from the DeathTrap in return for something nasty).
pt_br: Alguns escritores tentam defender o Fausto ao transformar o acordo em um Br/ContratoLeonino - ou o trato foi feito quando o Fausto estava em apuros, ou Mefistófeles fez a oferta quando a vítima não tinha tempo para pensar (e.g. oferecendo salvá-lo de uma Br/ArmadilhaMortal em troca de algo perverso).

source: Some {{Guile Hero}}es can make it into a MeaninglessVillainVictory.
pt_br: Alguns [[Br/HeroiAstuto heróis astutos]] conseguem transformar isso em uma Br/VitoriaInutilDoVilao.

source: Some, but [[Administrivia/TropesAreTools not all]] retcons are {{Ass Pull}}s, and a good retcon can actually improve the current narrative.
pt_br: Alguns (mas [[BrAdministrivia/TroposSaoFerramentas não todos]]) ''retcons'' são tirados da bunda, e um ''retcon'' bem feito pode melhorar a narrativa atual.

source: Somehow he made a drink that looks like it's roselle that is actually tamarind, but it tastes like lemon.
pt_br: De algum modo ele preparou uma bebida que parece ser de laranja mas na verdade é de tamarindo e que tem gosto de limão.

source: Someone -- typically a RulesLawyer -- does something outrageous by finding a loophole in the rules, which were too [[ExactWords narrowly written]] to consider such possibilities.
pt_br: Alguém -- geralmente um Br/JuristaDasRegras -- faz algo ultrajante ao encontrar uma brecha nas regras, que foram escritas de maneira [[Br/PalavrasExatas muito restrita]] para considerar tais possibilidades.

source: Someone cannot be harmed.
pt_br: Alguém não pode ser ferido.

source: Something like "People Cutting Their Fingers With An 80s Nail Clipper" is an example of something that's both People Sit on Chairs ''and'' Too Rare to Trope at the same time, as it's not specific-to-fiction, doesn't convey any meaning and has practically no examples to speak of.
pt_br: Algo tipo "Pessoas Cortando Os Dedos Com Um Cortador De Unhas Dos Anos 80" é um exemplo de algo que é ao mesmo tempo Pessoas Sentam Em Cadeiras ''e'' Raro Demais Para Ser Um Tropo ao mesmo tempo, já que não é específico da ficção, não tem nenhum significado intrínseco e não tem exemplos para ilustrar.

source: Sometimes Doña Florinda realizes Don Ramón is not a monster and develops a modicum of respect for him.
pt_br: Às vezes a Dona Florinda entende que o Seu Madruga não é um monstro e desenvolve algum respeito com ele.

source: Sometimes Quico learns that his possessions aren't everything.
pt_br: Às vezes Quico aprende que posses não são tudo.

source: Sometimes TheUnfettered, depending on whether they feel freed or enslaved by their bloodlust.
pt_br: Às vezes é Br/OIrrestrito, dependendo de como eles se sentem em relação ao seu desejo pelo derramamento de sangue.

source: Sometimes a Woobie goes OmnicidalManiac and seeks to destroy the world in a bid to make the pain stop, in which case you're dealing with a WoobieDestroyerOfWorlds.
pt_br: Às vezes o Coitadinho se torna um Br/ManiacoOmnicida e tenta destruir o mundo em uma tentativa de fazer a dor cessar, caso em que você estará lidando com um Br/CoitadinhoODestruidorDeMundos.

source: Sometimes a badly thought-out plot for the sake of action has exactly the same effect when FridgeLogic catches its tail.
pt_br: Às vezes uma trama mal-pensada que prioriza a ação alcança este mesmo efeito quando é alcançada pela Br/LogicaDeGeladeira.

source: Sometimes a moment like this is [[EstablishingCharacterMoment used to introduce a heroic character]].
pt_br: Às vezes uma ocasião como essa é usada para [[Br/MomentoDeEstabelecimentoDePersonagem apresentar um personagem heroico]].

source: Sometimes a result of DependingOnTheWriter or DependingOnTheArtist.
pt_br: Às vezes é resultado de Br/DependeDoRoteirista ou Br/DependeDoArtista.

source: Sometimes a vaguely defined nigh-invulnerability is a way to make a hero [[StrongAsTheyNeedToBe only as tough as he needs to be to advance the plot]].
pt_br: Às vezes, uma quase-invulnerabilidade vagamente definida é um jeito de tornar um herói Br/TaoForteQuantoNecessario apenas para que se avance a trama.

source: Sometimes an episode which is a PeriodPiece may ''look'' fancy and expensive, but these are often using the studio's already-existing (thus free) costumes and sets.
pt_br: Às vezes um episódio que é uma Br/ObraDeEpoca pode ''parecer'' sofisticado e caro, mas esses costumam usar os trajes e cenários já existentes do estúdio (ou seja, sai de graça reutilizar esses itens).

source: Sometimes can be [[SpoofAesop intentional]], but more often are noticed by audiences.
pt_br: Às vezes é [[Br/EsopoParodiado intencional]], mas geralmente é percebido pelo público.

source: Sometimes done in a quieter way as CharacterDevelopment in a non-fantasy setting, where a character is looking to undo a past mistake or wrong to a love one that has haunted them or caused misery for people around them.
pt_br: Às vezes é feito de forma silenciosa como Br/DesenvolvimentoDePersonagem em uma ambientação que não seja de fantasia, onde um personagem busca desfazer um erro do passado que machucou alguém querido ou causou dor para as pessoas em volta.

source: Sometimes done to maintain the status quo but other times it's played purely for BlackComedy.
pt_br: Às vezes é feito para manter o status quo mas em outras vezes é usado puramente para Br/HumorNegro.

source: Sometimes everything is carefully set up and orchestrated, so that events unfold in an organic, natural fashion.
pt_br: Às vezes, tudo é cuidadosamente posicionado e orquestrado para que os eventos se desenrolem de maneira natural e orgânica.

source: Sometimes falls into ThemeNaming (including ShoutOutThemeNaming, NamedAfterSomebodyFamous, and FamousNamedForeigner), MemorialCharacter, and WriteWhoYouKnow.
pt_br: Às vezes cai nas categorias de Br/NomenclaturaTematica (incluindo Br/MandarUmSalveComNomenclaturaTematica, Br/NomeadoAPartirDeAlguemFamoso e Br/EstrangeiroComNomeFamoso), Br/PersonagemMemorial e Br/EscrevaSobreQuemConhece.

source: Sometimes it has [[MadeOfTemptation no practical value whatsoever]].
pt_br: Às vezes o que se oferece [[Br/FeitoDeTentacao não possui valor prático]].

source: Sometimes it's just a moment or piece of writing viewed as stupid, unpopular, or simply not making sense within that universe.
pt_br: Às vezes é apenas uma parte da escrita que é tida como estúpida, impopular ou apenas sem encaixar bem no universo da obra.

source: Sometimes it's possible to bring such a woobie back from the edge, but other times, only their destruction in a ShootTheDog moment will stop things.
pt_br: Às vezes é possível trazer de volta um coitadinho como esse, mas em outras vezes apenas a destruição deles em um momento de Br/AtirarNoCachorro vai impedir as coisas.

source: Sometimes it's simply limited to a silent look towards the camera, though.
pt_br: Às vezes isso é limitado a um olhar silencioso na direção da câmera.

source: Sometimes just meant to look futuristic.
pt_br: Às vezes é feito para parecer futurista.

source: Sometimes overlaps with DevilInPlainSight, but is often the "grown up" version, where the "look cute" fallback has become a fairly professional strategy.
pt_br: Às vezes se sobrepõe com Br/DiaboEmPlenaVista, mas costuma ser uma versão mais "crescida", em que a estratégia de se passar por bonzinho quando as atenções estão voltadas para si se torna um truque profissional.

source: Sometimes overlaps with GenreSavvy and NoSenseOfHumor.
pt_br: Às vezes se sobrepõe a Br/LigadoNoGenero e Br/SemSensoDeHumor.

source: Sometimes reality itself conspires to hide the plot from their minds, in ways like the ExtraStrengthMasquerade, BystanderSyndrome, WeirdnessCensor, and InvisibleToNormals.
pt_br: Às vezes a própria realidade conspira para esconder a trama de suas mentes, geralmente através de Br/MascaramentoExtraForte, Br/SindromeDoObservador, Br/CensorDeEsquisitice e Br/InvisivelParaOsNormais.

source: Sometimes retcons involve little more than altering the timeline of events to occur later than originally stated.
pt_br: Às vezes os ''retcons'' envolvem pouco mais que alterar a cronologia dos eventos para que ocorram um pouco depois do originalmente declarado.

source: Sometimes single-location episodes are written as a SelfImposedChallenge by the writers, and might ironically cost ''more'' than a standard episode if the one location is new and/or elaborate.
pt_br: Às vezes os episódios de local único são escritos como um Br/DesafioAutoImposto pelos escritores, e ironicamente podem custar ''mais'' que um episódio regular se o local escolhido é novo e/ou elaborado.

source: Sometimes the Deadpan Snarker is shown to be incapable of avoiding sarcasm, due to their insecurity about expressing any genuine thought or feeling, and their fear of withdrawing from the cynical position and protection.
pt_br: Às vezes o Sarcástico Sério é mostrado como incapaz de evitar sarcasmo devido à sua insegurança em expressar qualquer pensamento ou sentimento genuínos junto com o receio de sair de uma posição de proteção baseada no cinismo.

source: Sometimes the author simply shows what warped the character into what they became without expecting the audience to feel any more sympathetic toward the character- a sort of psychological HowWeGotHere.
pt_br: Às vezes o autor simplesmente mostra o que alterou a percepção do personagem sem esperar que o público tenha simpatia por ele -- de certo modo, uma versão mais psicológica sobre Br/ComoChegamosAqui.

source: Sometimes the discontinuity is more subtle, such as a single line of dialogue or the specifics of an event.
pt_br: Às vezes a descontinuidade é mais sutil, tal como uma única linha de diálogo ou detalhes menores de um evento.

source: Sometimes the loophole doesn't really exist, but the competitor is convinced it does based on his own misinterpretation of the rules.
pt_br: Às vezes essa brecha não existe realmente, mas o competidor está convencido de que existe com base em sua própria interpretação errônea das regras.

source: Sometimes the result of a PermanentPlaceholder, if the writer just names the character after a friend or loved one just to keep his momentum going fully intending to change it in a later edit, but subsequently either grows to like it or simply forgets.
pt_br: Às vezes resulta de Br/TemporarioDeCunhoPermanente, se o escritor simplesmente deu ao personagem o nome de um amigo ou pessoa próxima para não perder o fio da meada e com a intenção de alterar o nome depois, mas acaba criando apreço pelo nome ou simplesmente se esquece.

source: Sometimes the story's {{A|nAesop}}esop requires a bittersweet ending in order to be effective.
pt_br: Às vezes, o [[Br/UmEsopo Esopo]] da história requer um final agridoce para ser eficaz.

source: Sometimes these are worlds and stories where you can EarnYourHappyEnding, though it won't be ExactlyWhatItSaysOnTheTin.\\ Also shows where too many romantic interests are introduced for one hero are doomed to end in this way or with NoRomanticResolution, since painless resolution is mostly impossible.
pt_br: Às vezes esses são mundos e histórias em que você pode Br/ConquistarOFinalFeliz, mas não será sempre Br/ExatamenteOQueEstaEscrito.\\ E shows onde muitos interesses românticos são apresentados ao herói são fadados a terminar desse jeito ou Br/SemResolucaoRomantica, pois a resolução indolor costuma ser impossível.

source: Sometimes they'll do so with an explicit statement (such as in a SpoilerOpening or HowWeGotHere), sometimes by writing a prequel that ends right where the original work begins.
pt_br: Às vezes eles fazem isso com uma declaração explícita (tal como uma Br/IntroducaoComSpoiler ou Br/ComoChegamosAqui), às vezes ao escrever uma prequência que termina onde a obra original começa.

source: Sometimes this will stick to the RuleOfThree, but sometimes a proper LongList will increase the humor.
pt_br: Isso costuma seguir a Br/RegraDoTres, mas às vezes uma Br/ListaLonga adequada vai aumentar o nível de humor.

source: Sometimes used to dump off the poor and other undesirables too.
pt_br: Às vezes é usado para despejar os pobres e outras pessoas indesejadas.

source: Sometimes writers will squeeze a story between existing entries in a series, making it both a sequel and a prequel.
pt_br: Às vezes os escritores espremem uma história entre entradas existentes, o que faz com que seja uma sequência e uma prequência ao mesmo tempo.

source: Sometimes you [[CompleteImmortality CAN'T]] [[KillTheGod kill a god]].
pt_br: Às vezes você simplesmente [[Br/ImortalidadeCompleta NÃO PODE]] [[Br/MatarODeus matar um deus]].

source: Sometimes, [[LightIsGood The Forces of Light and Goodness]] get a [[TheUnfettered little bit]] [[GoneHorriblyRight too hardcore]].
pt_br: Às vezes, [[Br/ALuzEBoa as Forças da Luz e da Bondade]] se tornam [[Br/OIrrestrito um pouco]] [[Br/DeuTerrivelmenteCerto excessivas]].

source: Sometimes, a story simply can't have an ending that is both happy and maintains the status quo--thus, these two powerful tropes are in conflict with each other.
pt_br: Às vezes, uma história não pode ter um final que seja ao mesmo tempo feliz e que mantenha o status quo -- portanto estes tropos conflitam entre si.

source: Sometimes, even LaserGuidedKarma misses its target.
pt_br: Às vezes até o Br/KarmaGuiadoPorLaser erra o alvo.

source: Sometimes, he refuses to hit Chilindrina for this reason, but in other episodes, he doesn't hesitate in wanting to hit her or Popis, even with brooms in some occasions.
pt_br: Às vezes ele se recusa a bater na Chiquinha por esse motivo, mas em outros episódios ele não hesita em querer bater nela ou na Popis, às vezes com uma vassoura.

source: Sometimes, he's OnlySaneByComparison, in which he's pretty crazy himself but not ''as'' crazy as the rest of his cohorts.
pt_br: Às vezes ele é Br/SaoApenasEmComparacao, no sentido que ele é um tanto maluco mas não ''tanto quanto'' os demais colegas.

source: Sometimes, however, authors choose to go a different route.
pt_br: No entanto, às vezes os autores decidem ir por uma direção diferente.

source: Sometimes, if the pre-retconned works are no longer considered canon by the author, those works are [[CanonDiscontinuity discontinued]] in canon.
pt_br: Às vezes, se as obras pré-retcon não são mais consideradas parte do cânone para o autor, essas obras são [[Br/DescontinuidadeDeCanone descontinuadas]] no cânone.

source: Sometimes, if you whack someone with the "insane stick" enough times, they'll get BoredWithInsanity.
pt_br: Às vezes, se você bater em alguém com o "bastão da insanidade" vezes o suficiente, ele pode ficar Br/EntediadoComAInsanidade.

source: Sometimes, it can be combined with Administrivia/TheSameButMoreSpecific, when an existing trope has a specification so rare, that it can't be tropable beyond a few existing examples.
pt_br: Às vezes dá pra combinar isso com Administrivia/OMesmoSoQueMaisEspecifico, quando um tropo existente tem uma definição tão estrita que não é possível tropar mais que uns poucos exemplos.

source: Sometimes, it's all the writers can think of to do with the character.
pt_br: Às vezes, isso é tudo que os escritores conseguem pensar em termos de uso do personagem.

source: Sometimes, it's followed by an exchange similar to the one that happens in "El Cumpleaños de Don Ramón", when Don Ramón wants Quico to tell him what he, Doña Florinda, Doña Clotilde and La Chilindrina were talking about[[note]]His ForgottenBirthday[[/note]]: --> '''Quico:''' Are you not going to tell anybody?\\ '''Don Ramón:''' No, Quico!\\ '''Quico:''' Me neither.
pt_br: Às vezes isso é seguido por um diálogo similar ao que ocorre em "O Aniversário de Seu Madruga", quando ele quer que Quico diga a ele o que ele, Dona Florinda, Dona Clotilde e Chiquinha estavam falando[[note]]nesse caso era o Br/AniversarioEsquecido[[/note]]: --> '''Quico:''' O senhor não conta pra ninguém?\\ '''Seu Madruga:''' Não, Quico!\\ '''Quico:''' Eu também não.
